.config/doom/config.org
#+TITLE:   klu's Configuration
#+DATE:    十月 17, 2020
#+SINCE:   1.0
#+STARTUP: content
#+PROPERTY: header-args :tangle config.el

* 使用的配置
如何 debug 可参考 doom 文档
https://github.com/hlissner/, move the cursor over
the highlighted symbol at press 'K' (non-evil users must press 'C-c c k').
This will open documentation for it, including demos of how they are used.
** 姓名和电子邮件
如 GPG 配置、电子邮件客户端、文件模板、片段等功能会使用这些来做身份识别。
#+begin_src emacs-lisp
;;; $DOOMDIR/config.el -*- lexical-binding: t; -*-

;; Some functionality uses this to identify you, e.g. GPG configuration, email
;; clients, file templates and snippets.
(setq user-full-name "klu"
      user-mail-address "k_foreign@outlook.com")
#+end_src
** 字体
Doom exposes five (optional) variables for controlling fonts in Doom. Here are the three important ones:
    `doom-font' 等宽字体
    `doom-variable-pitch-font' 不等宽字体
    `doom-big-font' – used for `doom-big-font-mode'; use this for presentations or streaming.
实验发现，doom-unicode-font 如果 *不* 设置 size 的话，在 helm-bibtex 中的中文不会像 doom-unicode-font 文档说的那样继承默认字体大小，而是使用英文字符大小的两倍，排列是整齐的。
#+BEGIN_SRC emacs-lisp
(setq doom-font (font-spec :family "source code pro" :size 24)
      doom-variable-pitch-font (font-spec :family "Source Code Variable" :size 18)
      doom-unicode-font (font-spec :family "思源黑体 CN")
      )
#+END_SRC
| this           | 中文字体“强”“言”出问题 |
| 中文字体出问题 | english                |
** 编码
也不知道为啥，如果把 language environment 设置为 'utf-8 的话，中文字体就出问题，doom-font 不起作用。
+这里是仿照 sis 的制作者的[[https://github.com/laishulu/conf/blob/master/emacs/doom/encoding.el][配置]]做的。+
使用了上述的配置之后，发现写中文的时候非常卡，所以参考 https://github.com/hick/emacs-chinese#emacs-的各种字符集 的配置，提升了速度。
#+BEGIN_SRC emacs-lisp
(set-language-environment "UTF-8")
(set-default-coding-systems 'utf-8)
(set-buffer-file-coding-system 'utf-8-unix)
(set-clipboard-coding-system 'utf-8-unix)
(set-file-name-coding-system 'utf-8-unix)
(set-keyboard-coding-system 'utf-8-unix)
(set-next-selection-coding-system 'utf-8-unix)
(set-selection-coding-system 'utf-8-unix)
(set-terminal-coding-system 'utf-8-unix)
(setq locale-coding-system 'utf-8)
(prefer-coding-system 'utf-8)

;; (setq locale-coding-system 'utf-8)
;; (set-terminal-coding-system 'utf-8)
;; (set-keyboard-coding-system 'utf-8)
;; (set-selection-coding-system 'utf-8)
;; (prefer-coding-system 'utf-8)
#+END_SRC
** 窗口
当分割窗口时，可以选择 buffer，使用 ivy 显示预览。
#+BEGIN_SRC emacs-lisp
(setq evil-vsplit-window-right t
      evil-split-window-below t)
(defadvice! prompt-for-buffer (&rest _)
  :after '(evil-window-split evil-window-vsplit)
  (+ivy/switch-buffer))
(setq +ivy-buffer-preview t)

(map! :leader "w d" #'kill-buffer-and-window
              "w D" #'delete-window)         ; doom原本使用这个快捷键关闭窗口，现在加上杀死缓冲区的功能。
(fringe-mode 8)                                       ; 窗口边缘宽度设为8
#+end_src
鼠标滑轮对应的窗口滚动设置小一点
#+begin_src emacs-lisp
(setq mouse-wheel-croll-amount
      '(2
        ((shift) . hscroll)
        ((meta))
        ((control) . text-scale)
        ))
#+end_src
全屏
#+BEGIN_SRC emacs-lisp
(if (eq initial-window-system 'x)                 ; if started by emacs command or desktop file
    (toggle-frame-maximized)
  (toggle-frame-fullscreen))
#+END_SRC
** 网络代理和包库镜像
#+BEGIN_SRC emacs-lisp
(setq url-proxy-services
      '(("no_proxy" . "^\\(localhost\\|10\\..*\\|192\\.168\\..*\\)")
        ("http" . "127.0.0.1:8889")
        ("https" . "127.0.0.1:8889")))
(setq package-archives '(("gnu"   . "http://mirrors.tuna.tsinghua.edu.cn/elpa/gnu/")
                         ("org-cn". "http://mirrors.tuna.tsinghua.edu.cn/elpa/org/")
                         ("melpa" . "http://mirrors.tuna.tsinghua.edu.cn/elpa/melpa/")))
#+END_SRC
** 导航工具 ivy
*** 使用 hydra 显示 action
由于[[https://github.com/abo-abo/swiper/issues/2694][这里的原因]]，ivy 显示 action 不全。
+这里使用链接里的方法：[[https://github.com/abo-abo/swiper/issues/2694#issuecomment-718681675][abo-abo/swiper#2694 Truncated list of actions]] 让 action 显示多列，从而让它显示完整。（可能也不太完整）+

上面链接的方法无效，决定按[[https://github.com/abo-abo/swiper/issues/2694#issuecomment-708418422][这里]]使用 hydra
doom 的 ivy 模块已经[[file:~/doom-emacs/modules/completion/ivy/config.el::ivy-read-action-function #'ivy-hydra-read-action][默认使用了]] ~ivy-hydra-read-action~ ，我不用再次设置了。
#+begin_src emacs-lisp
;; (setq ivy-read-action-function 'ivy-hydra-read-action)
#+end_src

*** 设置高度（按行数计量）
#+begin_src emacs-lisp
(setq ivy-height 12)
#+end_src

*** ivy-posframe
#+begin_src emacs-lisp :tangle no
(use-package! ivy-posframe
  :config
  (setq ivy-posframe-display-functions-alist
        '((counsel-git-grep . ivy-display-function-fallback)
          (counsel-grep . ivy-display-function-fallback)
          (counsel-rg . ivy-display-function-fallback)
          (counsel-describe-variable . ivy-display-function-fallback)
          (counsel-describe-function . ivy-display-function-fallback)
          (counsel-describe-face . ivy-display-function-fallback)
          (complete-symbol . ivy-posframe-display-at-point)
          (t               . +ivy-display-at-frame-center-near-bottom-fn)
          ))
  
  ;; https://github.com/tumashu/ivy-posframe/issues/105#issuecomment-750370286
  (defun my-ivy-posframe-get-size ()
    "Set the ivy-posframe size according to the current frame."
    (let ((height (or ivy-posframe-height (or ivy-height 10)))
          (width (min (or ivy-posframe-width 200) (round (* .75 (frame-width))))))
      (list :height height :width width :min-height height :min-width width)))

  (setq ivy-posframe-size-function 'my-ivy-posframe-get-size)
  )
#+end_src
*** ivy-rich 设置
#+begin_src emacs-lisp
(use-package! ivy-rich
  :config
  (setq ivy-rich-path-style 'relative)
  (plist-delete! ivy-rich-display-transformers-list :counsel-M-x)
  (plist-put! ivy-rich-display-transformers-list
              'ivy-switch-buffer
              '(:columns
                ((ivy-switch-buffer-transformer (:width 0.25))
                 (ivy-rich-switch-buffer-size (:width 7))
                 (ivy-rich-switch-buffer-indicators (:width 4 :face error :align right))
                 (ivy-rich-switch-buffer-major-mode (:width 0.1 :face warning))
                 (ivy-rich-switch-buffer-project (:width 0.1 :face success))
                 (ivy-rich-switch-buffer-path
                  (:width (lambda (x)
                            (ivy-rich-switch-buffer-shorten-path x (ivy-rich-minibuffer-width 0.1))))))
                :predicate
                (lambda (cand) (get-buffer cand)))
              )
  (progn
    (ivy-rich-mode -1)
    (ivy-rich-mode 1))
  )
#+end_src

** word-wrap 关闭按词换行，以更好显示中文
或许未来可以使用中文分词的包 + 按词换行，现在就这么设置吧
#+begin_src emacs-lisp
(add-hook 'org-mode-hook
          (lambda nil
            (setq word-wrap nil))
          )
#+end_src
** 正则表达式 builder 默认语法设置
https://www.masteringemacs.org/article/re-builder-interactive-regexp-builder
这里介绍了 string 的语法相较于默认的 read 来说，不需要过多的反斜杠。
emacs 中处理正则表达式的方法不受这个影响，这只影响 builder
#+begin_src emacs-lisp
(setq reb-re-syntax 'string)
#+end_src
** 其他基本设置
#+BEGIN_SRC emacs-lisp
(setq doom-theme 'modus-operandi
      undo-limit 8000000              ; 提高 undo-limit 到 80Mb
      evil-want-fine-undo t            ; 默认在插入模式下，所有更改都是一大块。这里改成更加颗粒化。
      auto-save-default t              ; 自动保存，保存为临时文件
      inhibit-compacting-font-caches t ; 如果有大量字符，将他们保存在内存中。
      delete-by-moving-to-trash t      ; 删除时使用系统回收站
      tab-width 4
      uniquify-buffer-name-style 'forward
      window-combination-resize t ; take new window space from all other windows (not just current)
      x-stretch-cursor t ; 把光标宽度拉到字符宽度
      large-file-warning-threshold 100000000
      +latex-viewers '(pdf-tools okular)
      doom-localleader-key ","
      ;; https://stackoverflow.com/questions/24196020/how-to-stop-emacs-from-contaminating-the-clipboard
      save-interprogram-paste-before-kill t
      display-line-numbers-type nil ; 默认关闭行号
)
(setq-default line-spacing 0.2)                ; 行间距
(delete-selection-mode 1)              ; 选择文字并插入文字时替换文本
;; (global-subword-mode 1) ; CamelCase单词也认作单词
(tooltip-mode 1)
;; (auto-save-visited-mode 1) ; 自动保存，这个是能存到浏览中文件里的自动保存
#+END_SRC

=org-directory= 必须在 org 包加载之前设置。
#+BEGIN_SRC emacs-lisp
(setq org-directory "~/org_notebooks/")
#+END_SRC
** org 以及文献管理相关
*** 不用空格分隔的粗体、斜体、下划线等特殊格式
#+begin_src elisp
(setq org-emphasis-regexp-components '("-[:multibyte:][:space:]('\"{" "-[:multibyte:][:space:].,:!?;'\")}\\[" "[:space:]" "." 1))
(org-set-emph-re 'org-emphasis-regexp-components org-emphasis-regexp-components)
(org-element-update-syntax)
#+end_src
*** 默认隐藏属性抽屉（PROPERTIES DRAWER）
#+begin_src emacs-lisp
(add-hook 'org-mode-hook (lambda () (org-cycle-hide-drawers 'all)))
#+end_src
*** html 导出的头部
#+begin_src emacs-lisp
(setq org-html-head
      "<link rel=\"stylesheet\" type=\"text/css\" href=\"src/readtheorg_theme/css/htmlize.css\"/>
<link rel=\"stylesheet\" type=\"text/css\" href=\"src/readtheorg_theme/css/readtheorg.css\"/>
<script type=\"text/javascript\" src=\"src/lib/js/jquery.min.js\"></script>
<script type=\"text/javascript\" src=\"src/lib/js/bootstrap.min.js\"></script>
<script type=\"text/javascript\" src=\"src/lib/js/jquery.stickytableheaders.min.js\"></script>
<script type=\"text/javascript\" src=\"src/readtheorg_theme/js/readtheorg.js\"></script>
")
#+end_src
*** evil 使用 F 切换 agenda-follow-mode
#+begin_src emacs-lisp
(after! org
  (map! :map org-agenda-mode-map
        :nm "F" #'org-agenda-follow-mode)
  )
#+end_src
*** 打开网页使用 firefox.
不知为何，使用 export-dispatcher 的导出并打开 html 文件的时候，无法打开，参考 https://emacs.stackexchange.com/questions/2387/browser-not-opening-when-exporting-html-from-org-mode 的方法，显式设置默认打开 html 文件的软件为 firefox
#+begin_src emacs-lisp
(after! org
  (setq org-file-apps
        '((remote . emacs)
         (auto-mode . emacs)
         (directory . emacs)
         ("\\.mm\\'" . default)
         ("\\.x?html?\\'" . "/usr/bin/firefox %s")
         ("\\.pdf\\'" . default))
        )
  )
#+end_src
*** 使用 RET 的时候，扩展列表
#+begin_src emacs-lisp :tangle no
(add-hook 'org-mode-hook (lambda ()
                           (map! :map org-mode-map
                                 :i "RET" 'evil-org-return)
                           ))
#+end_src
*** 表格的中英文图片对齐 valign
#+begin_src elisp
(add-hook 'org-mode-hook #'valign-mode)
(setq valign-fancy-bar t)
#+end_src

