.config/doom/config.el
;;; $DOOMDIR/config.el -*- lexical-binding: t; -*-

;; Some functionality uses this to identify you, e.g. GPG configuration, email
;; clients, file templates and snippets.
(setq user-full-name "klu"
      user-mail-address "k_foreign@outlook.com")

(setq doom-font (font-spec :family "source code pro" :size 24)
      doom-variable-pitch-font (font-spec :family "Source Code Variable" :size 18)
      doom-unicode-font (font-spec :family "思源黑体 CN")
      )

(set-language-environment "UTF-8")
(set-default-coding-systems 'utf-8)
(set-buffer-file-coding-system 'utf-8-unix)
(set-clipboard-coding-system 'utf-8-unix)
(set-file-name-coding-system 'utf-8-unix)
(set-keyboard-coding-system 'utf-8-unix)
(set-next-selection-coding-system 'utf-8-unix)
(set-selection-coding-system 'utf-8-unix)
(set-terminal-coding-system 'utf-8-unix)
(setq locale-coding-system 'utf-8)
(prefer-coding-system 'utf-8)

;; (setq locale-coding-system 'utf-8)
;; (set-terminal-coding-system 'utf-8)
;; (set-keyboard-coding-system 'utf-8)
;; (set-selection-coding-system 'utf-8)
;; (prefer-coding-system 'utf-8)

(setq evil-vsplit-window-right t
      evil-split-window-below t)
(defadvice! prompt-for-buffer (&rest _)
  :after '(evil-window-split evil-window-vsplit)
  (+ivy/switch-buffer))
(setq +ivy-buffer-preview t)

(map! :leader "w d" #'kill-buffer-and-window
              "w D" #'delete-window)         ; doom原本使用这个快捷键关闭窗口，现在加上杀死缓冲区的功能。
(fringe-mode 8)                                       ; 窗口边缘宽度设为8

(setq mouse-wheel-croll-amount
      '(2
        ((shift) . hscroll)
        ((meta))
        ((control) . text-scale)
        ))

(if (eq initial-window-system 'x)                 ; if started by emacs command or desktop file
    (toggle-frame-maximized)
  (toggle-frame-fullscreen))

(setq url-proxy-services
      '(("no_proxy" . "^\\(localhost\\|10\\..*\\|192\\.168\\..*\\)")
        ("http" . "127.0.0.1:8889")
        ("https" . "127.0.0.1:8889")))
(setq package-archives '(("gnu"   . "http://mirrors.tuna.tsinghua.edu.cn/elpa/gnu/")
                         ("org-cn". "http://mirrors.tuna.tsinghua.edu.cn/elpa/org/")
                         ("melpa" . "http://mirrors.tuna.tsinghua.edu.cn/elpa/melpa/")))

;; (setq ivy-read-action-function 'ivy-hydra-read-action)

(setq ivy-height 12)

(use-package! ivy-rich
  :config
  (setq ivy-rich-path-style 'relative)
  (plist-delete! ivy-rich-display-transformers-list :counsel-M-x)
  (plist-put! ivy-rich-display-transformers-list
              'ivy-switch-buffer
              '(:columns
                ((ivy-switch-buffer-transformer (:width 0.25))
                 (ivy-rich-switch-buffer-size (:width 7))
                 (ivy-rich-switch-buffer-indicators (:width 4 :face error :align right))
                 (ivy-rich-switch-buffer-major-mode (:width 0.1 :face warning))
                 (ivy-rich-switch-buffer-project (:width 0.1 :face success))
                 (ivy-rich-switch-buffer-path
                  (:width (lambda (x)
                            (ivy-rich-switch-buffer-shorten-path x (ivy-rich-minibuffer-width 0.1))))))
                :predicate
                (lambda (cand) (get-buffer cand)))
              )
  (progn
    (ivy-rich-mode -1)
    (ivy-rich-mode 1))
  )

(add-hook 'org-mode-hook
          (lambda nil
            (setq word-wrap nil))
          )

(setq reb-re-syntax 'string)

(setq doom-theme 'modus-operandi
      undo-limit 8000000              ; 提高 undo-limit 到 80Mb
      evil-want-fine-undo t            ; 默认在插入模式下，所有更改都是一大块。这里改成更加颗粒化。
      auto-save-default t              ; 自动保存，保存为临时文件
      inhibit-compacting-font-caches t ; 如果有大量字符，将他们保存在内存中。
      delete-by-moving-to-trash t      ; 删除时使用系统回收站
      tab-width 4
      uniquify-buffer-name-style 'forward
      window-combination-resize t ; take new window space from all other windows (not just current)
      x-stretch-cursor t ; 把光标宽度拉到字符宽度
      large-file-warning-threshold 100000000
      +latex-viewers '(pdf-tools okular)
      doom-localleader-key ","
      ;; https://stackoverflow.com/questions/24196020/how-to-stop-emacs-from-contaminating-the-clipboard
      save-interprogram-paste-before-kill t
      display-line-numbers-type nil ; 默认关闭行号
)
(setq-default line-spacing 0.2)                ; 行间距
(delete-selection-mode 1)              ; 选择文字并插入文字时替换文本
;; (global-subword-mode 1) ; CamelCase单词也认作单词
(tooltip-mode 1)
;; (auto-save-visited-mode 1) ; 自动保存，这个是能存到浏览中文件里的自动保存

(setq org-directory "~/org_notebooks/")

(add-hook 'org-mode-hook (lambda () (org-cycle-hide-drawers 'all)))

(setq org-html-head
      "<link rel=\"stylesheet\" type=\"text/css\" href=\"src/readtheorg_theme/css/htmlize.css\"/>
<link rel=\"stylesheet\" type=\"text/css\" href=\"src/readtheorg_theme/css/readtheorg.css\"/>
<script type=\"text/javascript\" src=\"src/lib/js/jquery.min.js\"></script>
<script type=\"text/javascript\" src=\"src/lib/js/bootstrap.min.js\"></script>
<script type=\"text/javascript\" src=\"src/lib/js/jquery.stickytableheaders.min.js\"></script>
<script type=\"text/javascript\" src=\"src/readtheorg_theme/js/readtheorg.js\"></script>
")

(after! org
  (map! :map org-agenda-mode-map
        :nm "F" #'org-agenda-follow-mode)
  )

(after! org
  (setq org-file-apps
        '((remote . emacs)
         (auto-mode . emacs)
         (directory . emacs)
         ("\\.mm\\'" . default)
         ("\\.x?html?\\'" . "/usr/bin/firefox %s")
         ("\\.pdf\\'" . default))
        )
  )
