.config/doom/config.org
*** latex 自定义一个干净的 org-latex-classes
#+begin_src emacs-lisp :tangle yes
(with-eval-after-load 'ox-latex
  (add-to-list 'org-latex-classes
               '("org-plain-latex"
                 "\\documentclass{ctexart}
           [NO-DEFAULT-PACKAGES]
           [PACKAGES]
           [EXTRA]"
                 ("\\section{%s}" . "\\section*{%s}")
                 ("\\subsection{%s}" . "\\subsection*{%s}")
                 ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
                 ("\\paragraph{%s}" . "\\paragraph*{%s}")
                 ("\\subparagraph{%s}" . "\\subparagraph*{%s}"))))
#+end_src
*** latex-beamer 导出选项，添加 ctexbeamer
#+begin_src elisp
(push '("ctexbeamer" "\\documentclass{ctexbeamer}"
        ("\\section{%s}" . "\\section*{%s}")
        ("\\subsection{%s}" . "\\subsection*{%s}")
        ("\\subsubsection{%s}" . "\\subsubsection*{%s}"))
      org-latex-classes)

(push '("ctexart" "\\documentclass{ctexart}"
        ("\\section{%s}" . "\\section*{%s}")
        ("\\subsection{%s}" . "\\subsection*{%s}")
        ("\\subsubsection{%s}" . "\\subsubsection*{%s}"))
      org-latex-classes)

(push '("beamerarticle" ""
        ("\\section{%s}" . "\\section*{%s}")
        ("\\subsection{%s}" . "\\subsection*{%s}")
        ("\\subsubsection{%s}" . "\\subsubsection*{%s}"))
      org-latex-classes)
#+end_src
*** latex 输入不使用 cdlatex
#+begin_src emacs-lisp
(use-package! org
  :init
  (remove-hook 'org-mode-hook 'org-cdlatex-mode) ;默认不使用cdlatex，我现在用auto-activating-snippets
  )
#+end_src
*** latex预览默认开启
#+begin_src elisp
(setq org-startup-with-latex-preview t)
#+end_src
*** latex 预览header中添加自定义命令
#+begin_src elisp
(let* (
      (default-header (eval (car (get 'org-format-latex-header 'standard-value))))
      (newcommand "
\\usepackage{bm}
")
      (new-header (concat default-header newcommand)))
  (setq org-format-latex-header new-header))
#+end_src

*** latex 预览的大小、颜色。
#+BEGIN_SRC emacs-lisp
(after! org
  (plist-put! org-format-latex-options
              :scale 2.2
              ;; :background "Transparent"
              ;; :html-background "Transparent"
              ;; :foreground "White"
              )
  (setq org-preview-latex-default-process 'dvipng)
  (setq-default org-startup-with-latex-preview nil) ; 是否启动时就预览latex.

  ;; 修复 `org-preview-latex-fragment' 中的颜色处理
  ;; https://github.com/hlissner/doom-emacs/issues/4023#issuecomment-735390477
  ;; (let ((dvipng--plist (alist-get 'dvipng org-preview-latex-process-alist)))
  ;;   ;; (plist-put dvipng--plist :use-xcolor t)
  ;;   (plist-put dvipng--plist :image-converter '("dvipng -D %D -T tight -o %O %f"))
  )
#+END_SRC
*** latex预览使用fragtog，快速切换预览和文本
#+begin_src elisp
(add-hook 'org-mode-hook (lambda () (org-fragtog-mode 1)))
#+end_src

*** latex 快速输入快捷键设置
https://emacs.stackexchange.com/questions/12552/how-bind-keys-to-a-specific-snippet-in-yasnippet-folder
#+BEGIN_SRC emacs-lisp
(defvar my-org-latex-delimiter-list '("inline" "display" "equation" "gather" "align")
  "几种常见的 latex 分隔符样式，用于 `my-expand-yasnippet-org-latex-inline'。")
(defvar my-org-latex-last-delimiter "inline"
  "上一个分隔符样式")

(defun my-org-latex-replace-delimiter (last-delimiter-list this-delimiter-list)
  (let* ((last-search-cons (elt last-delimiter-list 0))
         (this-replace-cons (elt this-delimiter-list 1))
         (last-search-str-b (car last-search-cons))
         (last-search-str-f (cdr last-search-cons))
         (this-replace-str-b (car this-replace-cons))
         (this-replace-str-f (cdr this-replace-cons))
         )
    (save-excursion
      (search-backward last-search-str-b)
      (replace-match this-replace-str-b)
      )
    (save-excursion
      (search-forward last-search-str-f)
      (replace-match this-replace-str-f)))
  )

(defun my-org-latex-get-delimiter-cons (delimiter-name)
  "返回每种分隔符对应的搜索cons和替换cons（二者可能不同）。"
  (cond ((equal delimiter-name "inline") (list (cons "\\(" "\\)") (cons "\\\\(" "\\\\)")))
        ((equal delimiter-name "display") (list (cons "\\[" "\\]") (cons "\\\\[" "\\\\]")))
        ((equal delimiter-name "equation") (list (cons "\\begin{equation}
"
                                                     "\\end{equation}")
                                               (cons "\\\\begin{equation}
"
                                                     "\\\\end{equation}")))
        ((equal delimiter-name "gather") (list (cons "\\begin{gather*}
"
                                                     "\\end{gather*}")
                                               (cons "\\\\begin{gather*}
"
                                                     "\\\\end{gather*}")))
        ((equal delimiter-name "align") (list (cons "\\begin{align*}
"
                                                    "\\end{align*}")
                                              (cons "\\\\begin{align*}
"
                                                    "\\\\end{align*}")))
        )
  )

;;;###autoload
(defun my-org-latex-start-math ()
  "首先检查当前点到行首的字符串，判断要不要插入空格，然后进入`sis-inline-mode'并插入latex分隔符
如果重复命令，会替换分隔符为 `my-org-latex-delimiter-list' 中的元素。"
  (interactive)

  (let* ((repeating-p (if (eq this-command last-command) t nil))
         (last-index (seq-position my-org-latex-delimiter-list my-org-latex-last-delimiter))
         (this-delimiter
          (if repeating-p
              ;; last-index 就是上一个分隔符在分隔符列表中的索引
              (or
               (when (eq (1- (length my-org-latex-delimiter-list)) last-index)
                 (car my-org-latex-delimiter-list))
               (elt my-org-latex-delimiter-list (1+ last-index)))
            (car my-org-latex-delimiter-list)))
         (str (buffer-substring (line-beginning-position) (point))))

    (if (not repeating-p)
        ;; 判断如果位于行首或者列表项目的起始，就不插入首空格
        (progn
          (if (or (equal str "")
                  (string-match-p "\\(^\\(- \\|+ \\|[0-9]\\. \\| *\\)$\\)\\|\\(.*[。？：；，（\\ ]$\\)" str))
              (progn (insert "\\")
                     ;; 使用sis的英语模式
                     (sis--inline-activate 'english (1- (point)))
                     (insert "(\\) "))
            (progn (insert " ")
                   (sis--inline-activate 'english (1- (point)))
                   (insert "\\(\\) ")))
          (backward-char 3)
          )
      ;; 如果在重复命令，那么就替换分隔符
      (my-org-latex-replace-delimiter
       (my-org-latex-get-delimiter-cons my-org-latex-last-delimiter)
       (my-org-latex-get-delimiter-cons this-delimiter)))
    ;; 设置上一个分隔符，可用于下一次
    (setq my-org-latex-last-delimiter this-delimiter)
    )
  )
#+END_SRC

https://emacs.stackexchange.com/questions/20240/how-to-distinguish-c-m-from-return/20241
要使用 C-m 而非对应的 enter ，需要在 =input-decode-map= 中定义按键。
#+BEGIN_SRC emacs-lisp
(dolist (hook '(org-mode-hook LaTeX-mode-hook))
  (add-hook hook
            (lambda ()
              (define-key input-decode-map [?\C-m] [C-m])
              (local-set-key (kbd "<C-m>") #'my-org-latex-start-math)))
  )
#+END_SRC

避免 orgmode 里列表中无法扩展数学公式的情况（暂不用，现在在使用 auto-snippet）
#+BEGIN_SRC emacs-lisp
;; (add-to-list 'org-tab-first-hook 'org-try-cdlatex-tab)
#+END_SRC
*** 预览图像宽度设置
#+begin_src emacs-lisp
(setq org-image-actual-width '(450))
#+end_src
*** 预览图像，打开文件即预览
#+begin_src elisp
(setq org-startup-with-inline-images t)
#+end_src
*** bibtex-completion
#+begin_src emacs-lisp
(map! :leader
      :prefix "f"
      :desc "find article" "a" #'ivy-bibtex
      )
(setq ivy-bibtex-default-action 'ivy-bibtex-insert-citation)
#+end_src
*** biblio 模块的几个默认值：pdf 存放地、bibliography 文件、notes 存放地
#+BEGIN_SRC emacs-lisp
(setq! +biblio-pdf-library-dir "/home/klu/Downloads/_Literature/"
       +biblio-default-bibliography-files '("~/mybibliography/bibliography.bib")
       +biblio-notes-path "~/org_notebooks/roam/public/")
#+END_SRC
*** org-roam 快捷键和默认目录
快捷键、roam-directory 设置
在 roam buffer 中不显示 tab、行号，开启 latex 预览。buffer 不自动打开。
#+BEGIN_SRC emacs-lisp
(use-package! org-roam
  :commands (org-roam-find-file)
  :init
  (setq org-roam-directory "~/org_notebooks/roam")
  (map! :leader
        :prefix "n"
        "l" #'org-roam
        "i" #'org-roam-insert
        "I" #'org-roam-insert-immediate
        "f" #'org-roam-find-file
        "c" #'org-roam-capture
        )
  (map! :leader
        :prefix "i"
        "b" #'orb-insert)
  :config
  ;; 在 roam buffer 中不显示 tab、行号，开启 latex 预览。buffer 不自动打开。
  (add-hook 'org-roam-buffer-prepare-hook
            (lambda nil
              (display-line-numbers-mode 0)
              (centaur-tabs-local-mode)
              (org-latex-preview '(16)))
            100)
  (setq +org-roam-open-buffer-on-find-file nil)
  )
#+END_SRC
