.config/doom/config.org
*** org-roam-capture 模板设置
#+BEGIN_SRC emacs-lisp
(setq my-org-roam-public-file-name "./public/%<%Y%m%d%H%M%S>-${slug}")
(setq my-org-roam-private-file-name "%<%Y%m%d%H%M%S>-${slug}")
(setq org-roam-capture-immediate-template
      `(:key "d"
        :description "默认公共笔记"
        :body "* 概括\n* 主要内容\n%?\n\n* 联系\n"
        :file-name ,my-org-roam-public-file-name))

(defvar my-org-roam-capture-format-list
  `(
    (
     :key "d"
     :description "默认公共笔记"
     :body #'my-org-roam-capture-template
     :file-name ,my-org-roam-public-file-name
     )
    (
     :key "p"
     :description "私有笔记"
     :body #'my-org-roam-capture-template
     :file-name ,my-org-roam-private-file-name
     )
    )
  "org-roam capture的默认格式")

(defun my-org-roam-capture-template ()
  "template for my note"
  (concat 
   "%?\n"
   "* 参考\n"
   "%a"
   "\n"
   ))

(setq org-roam-capture-templates
      (let (templates)
        (dolist (singlelist my-org-roam-capture-format-list templates)
          (let ((template
                 `(
                   ,(plist-get singlelist :key) ,(plist-get singlelist :description)
                   plain #'org-roam-capture--get-point
                   ,(plist-get singlelist :body)
                   :file-name ,(plist-get singlelist :file-name)
                   :head ,(concat
                           "#+title: ${title}\n#+roam_tags: "
                           (plist-get singlelist :tags)
                           "\n#+roam_alias: \n\n"
                           )
                   :unnarrowed t)))
            ;; 在 templates 的后面添加
            (setq templates (append templates `(,template)))
            )
          )
        )
      )

(defun prompt-for-roam-tags-and-alias ()
  (org-roam-tag-add)
  (org-roam-alias-add)
  nil)
#+END_SRC

#+RESULTS:
: prompt-for-roam-tags-and-alias

*** org-roam-server 设置
#+BEGIN_SRC emacs-lisp
(use-package! org-roam-server
  :after org-roam
  :config
  (setq org-roam-server-host "127.0.0.1"
        org-roam-server-port 9090
        org-roam-server-authenticate nil
        org-roam-server-export-inline-images t
        ;; org-roam-server-serve-files nil
        ;; org-roam-server-served-file-extensions '("pdf" "mp4" "ogv")
        ;; org-roam-server-network-poll t
        ;; org-roam-server-network-arrows nil
        org-roam-server-network-label-truncate t
        org-roam-server-network-label-truncate-length 60
        org-roam-server-network-label-wrap-length 20)
  )
(org-roam-server-mode)
#+END_SRC
*** org-roam-bibtex
模板，使用 orb-insert 的时候会被调用。
#+begin_src emacs-lisp
(defun my-orb-latex-note-to-org (citekey)
  (let* ((entry (bibtex-completion-get-entry citekey))
         (note (bibtex-completion-get-value "note" entry ""))
         (pandoc-command "pandoc --from latex --to org")
         result)
    (with-temp-buffer
      (shell-command (format "echo \"%s\" | %s" note pandoc-command)
                     (current-buffer))
      (setq result (buffer-substring-no-properties (point-min) (point-max))))))

(setq orb-preformat-keywords '(
                               ("citekey" . "=key=")
                               "note"
                               "title"
                               "url"
                               "file"
                               "author-or-editor"
                               "keywords"))
(setq orb-templates
      '(("r" "ref" plain (function org-roam-capture--get-point)
         ""
         :file-name "./public/${=key=}_${title}"
         :head "#+TITLE: ${=key=}: ${title}
,#+roam_key: ${ref}
,#+roam_tags: lit
- tags ::
- keywords :: ${keywords}

,* ${title}
:PROPERTIES:
:Custom_ID: ${=key=}
:URL: ${url}
:AUTHOR: ${author-or-editor}
:NOTER_DOCUMENT: %(orb-process-file-field \"${=key=}\")
:NOTER_PAGE:
:END:

,* Annotations (zotero)

%(my-orb-latex-note-to-org \"${citekey}\")
"
         :unnarrowed t)))
#+end_src

参照 https://github.com/org-roam/org-roam-bibtex#orb-insert-link-description ，将插入的 bibtex 链接默认设置为 org-ref 引用格式。
#+begin_src emacs-lisp
(setq orb-insert-link-description 'citation)
#+end_src
*** org-roam 面板 delve
#+begin_src emacs-lisp
(use-package! delve
  :bind (("<f12>" . delve-open-or-select))
  :config
  (evil-define-key* '(normal insert) delve-mode-map
    (kbd "<return>") #'lister-key-action
    (kbd "<tab>") #'delve-expand-toggle-sublist
    (kbd "gr") #'delve-revert
    (kbd "s") #'delve-sort-sublist
    (kbd "<right>") #'delve-expand-insert-tolinks
    (kbd "<left>")  #'delve-expand-insert-backlinks
    (kbd "c") #'delve-collect
    (kbd "q") #'delve-kill-buffer)
  )
(use-package! delve-minor-mode
  :config
  (add-hook 'org-mode-hook #'delve-minor-mode-maybe-activate)
  )
#+end_src
*** org-roam CAPTURE popup 的大小
#+begin_src emacs-lisp
(set-popup-rule! "^CAPTURE-.*\\.org$" :side 'left :size 0.5 :quit nil :select t :autosave t)
#+end_src
*** Org-journal
设置 journal 的时间戳格式为“年月日”
carryover-items 添加 IDEA
#+BEGIN_SRC emacs-lisp
(use-package! org-journal
  :init
  (setq
   org-journal-time-format "IDEA %Y%m%d "
   org-journal-date-prefix "#+TITLE: "
   org-journal-dir "~/org_notebooks/journal/"
   org-journal-file-format "%Y-%m-%d.org"
   org-journal-date-format "%A, %x"
   org-journal-carryover-delete-empty-journal 'ask
   )
  :config
  (setq org-journal-find-file #'find-file-other-window)
  ;; 创建新条目的时候进入插入模式
  (add-hook 'org-journal-after-entry-create-hook (lambda nil (evil-append 1)))
  (setq org-journal-carryover-items "TODO=\"TODO\"|TODO=\"PROJ\"|TODO=\"IDEA\"")
  )
;; (setq org-journal-enable-agenda-integration t)
#+END_SRC
*** agenda 使用 org-super-agenda
我使用 org-super-agenda 进行 GTD 的总体规划：

首先在 org-journal 中记录 IDEA，在全局概览中要执行哪些 IDEA 就转换成 TODO，完成后转换为 DONE。

使用 PROJ 的条目满足下列条件之一：
- 该任务需要在其他任务完成之后才能完成

对于需要在某个特定时间开始执行的任务（SCHEDULED 任务），使用 TODO 标识并设置开始时间。

综上所述，只需要 IDEA、TODO、DONE、PROJ 四种标志。

**** 设置 TODO 状态变成 DONE 的时候记录时间
记录在 drawer 里面，把状态改变记录就放在标题下面，不放在 drawer 下面。
#+begin_src emacs-lisp
(setq org-log-done 'time
      org-log-into-drawer t
      org-log-state-notes-insert-after-drawers nil
      org-agenda-start-with-log-mode t)
#+end_src

**** 自动设置标签、优先级等的函数
参考
https://github.com/jethrokuan/dots/blob/master/.doom.d/config.el
https://github.com/jethrokuan/dots/blob/master/.doom.d/config.el#L279
我把 refile 功能删了
#+begin_src emacs-lisp
(defvar jethro/org-current-effort "1:00"
  "Current effort for agenda items.")

(defun jethro/my-org-agenda-set-effort (effort)
  "Set the effort property for the current headline."
  (interactive
   (list (read-string (format "Effort [%s]: " jethro/org-current-effort) nil nil jethro/org-current-effort)))
  (setq jethro/org-current-effort effort)
  (org-agenda-check-no-diary)
  (let* ((hdmarker (or (org-get-at-bol 'org-hd-marker)
                       (org-agenda-error)))
         (buffer (marker-buffer hdmarker))
         (pos (marker-position hdmarker))
         (inhibit-read-only t)
         newhead)
    (org-with-remote-undo buffer
      (with-current-buffer buffer
        (widen)
        (goto-char pos)
        (org-show-context 'agenda)
        (funcall-interactively 'org-set-effort nil jethro/org-current-effort)
        (end-of-line 1)
        (setq newhead (org-get-heading)))
      (org-agenda-change-all-lines newhead hdmarker))))

(defun jethro/org-agenda-process-inbox-item ()
  "处理agenda中的各项，只处理优先级就够了"
  (org-with-wide-buffer
   ;; (org-agenda-set-tags)
   (org-agenda-priority-up)
   (org-agenda-priority-up)
   ;; (call-interactively 'jethro/my-org-agenda-set-effort)
   ))

;; (defvar jethro/org-agenda-bulk-process-key ?f
;;   "Default key for bulk processing inbox items.")

(setq org-agenda-bulk-custom-functions '((?b jethro/org-agenda-process-inbox-item)))
#+end_src

