.config/doom/config.el

(setq my-org-roam-public-file-name "./public/%<%Y%m%d%H%M%S>-${slug}")
(setq my-org-roam-private-file-name "%<%Y%m%d%H%M%S>-${slug}")
(setq org-roam-capture-immediate-template
      `(:key "d"
        :description "默认公共笔记"
        :body "* 概括\n* 主要内容\n%?\n\n* 联系\n"
        :file-name ,my-org-roam-public-file-name))

(defvar my-org-roam-capture-format-list
  `(
    (
     :key "d"
     :description "默认公共笔记"
     :body #'my-org-roam-capture-template
     :file-name ,my-org-roam-public-file-name
     )
    (
     :key "p"
     :description "私有笔记"
     :body #'my-org-roam-capture-template
     :file-name ,my-org-roam-private-file-name
     )
    )
  "org-roam capture的默认格式")

(defun my-org-roam-capture-template ()
  "template for my note"
  (concat 
   "%?\n"
   "* 参考\n"
   "%a"
   "\n"
   ))

(setq org-roam-capture-templates
      (let (templates)
        (dolist (singlelist my-org-roam-capture-format-list templates)
          (let ((template
                 `(
                   ,(plist-get singlelist :key) ,(plist-get singlelist :description)
                   plain #'org-roam-capture--get-point
                   ,(plist-get singlelist :body)
                   :file-name ,(plist-get singlelist :file-name)
                   :head ,(concat
                           "#+title: ${title}\n#+roam_tags: "
                           (plist-get singlelist :tags)
                           "\n#+roam_alias: \n\n"
                           )
                   :unnarrowed t)))
            ;; 在 templates 的后面添加
            (setq templates (append templates `(,template)))
            )
          )
        )
      )

(defun prompt-for-roam-tags-and-alias ()
  (org-roam-tag-add)
  (org-roam-alias-add)
  nil)

(use-package! org-roam-server
  :after org-roam
  :config
  (setq org-roam-server-host "127.0.0.1"
        org-roam-server-port 9090
        org-roam-server-authenticate nil
        org-roam-server-export-inline-images t
        ;; org-roam-server-serve-files nil
        ;; org-roam-server-served-file-extensions '("pdf" "mp4" "ogv")
        ;; org-roam-server-network-poll t
        ;; org-roam-server-network-arrows nil
        org-roam-server-network-label-truncate t
        org-roam-server-network-label-truncate-length 60
        org-roam-server-network-label-wrap-length 20)
  )
(org-roam-server-mode)

(defun my-orb-latex-note-to-org (citekey)
  (let* ((entry (bibtex-completion-get-entry citekey))
         (note (bibtex-completion-get-value "note" entry ""))
         (pandoc-command "pandoc --from latex --to org")
         result)
    (with-temp-buffer
      (shell-command (format "echo \"%s\" | %s" note pandoc-command)
                     (current-buffer))
      (setq result (buffer-substring-no-properties (point-min) (point-max))))))

(setq orb-preformat-keywords '(
                               ("citekey" . "=key=")
                               "note"
                               "title"
                               "url"
                               "file"
                               "author-or-editor"
                               "keywords"))
(setq orb-templates
      '(("r" "ref" plain (function org-roam-capture--get-point)
         ""
         :file-name "./public/${=key=}_${title}"
         :head "#+TITLE: ${=key=}: ${title}
#+roam_key: ${ref}
#+roam_tags: lit
- tags ::
- keywords :: ${keywords}

* ${title}
:PROPERTIES:
:Custom_ID: ${=key=}
:URL: ${url}
:AUTHOR: ${author-or-editor}
:NOTER_DOCUMENT: %(orb-process-file-field \"${=key=}\")
:NOTER_PAGE:
:END:

* Annotations (zotero)

%(my-orb-latex-note-to-org \"${citekey}\")
"
         :unnarrowed t)))

(setq orb-insert-link-description 'citation)

(use-package! delve
  :bind (("<f12>" . delve-open-or-select))
  :config
  (evil-define-key* '(normal insert) delve-mode-map
    (kbd "<return>") #'lister-key-action
    (kbd "<tab>") #'delve-expand-toggle-sublist
    (kbd "gr") #'delve-revert
    (kbd "s") #'delve-sort-sublist
    (kbd "<right>") #'delve-expand-insert-tolinks
    (kbd "<left>")  #'delve-expand-insert-backlinks
    (kbd "c") #'delve-collect
    (kbd "q") #'delve-kill-buffer)
  )
(use-package! delve-minor-mode
  :config
  (add-hook 'org-mode-hook #'delve-minor-mode-maybe-activate)
  )

(set-popup-rule! "^CAPTURE-.*\\.org$" :side 'left :size 0.5 :quit nil :select t :autosave t)

(use-package! org-journal
  :init
  (setq
   org-journal-time-format "IDEA %Y%m%d "
   org-journal-date-prefix "#+TITLE: "
   org-journal-dir "~/org_notebooks/journal/"
   org-journal-file-format "%Y-%m-%d.org"
   org-journal-date-format "%A, %x"
   org-journal-carryover-delete-empty-journal 'ask
   )
  :config
  (setq org-journal-find-file #'find-file-other-window)
  ;; 创建新条目的时候进入插入模式
  (add-hook 'org-journal-after-entry-create-hook (lambda nil (evil-append 1)))
  (setq org-journal-carryover-items "TODO=\"TODO\"|TODO=\"PROJ\"|TODO=\"IDEA\"")
  )
;; (setq org-journal-enable-agenda-integration t)

(setq org-log-done 'time
      org-log-into-drawer t
      org-log-state-notes-insert-after-drawers nil
      org-agenda-start-with-log-mode t)

(defvar jethro/org-current-effort "1:00"
  "Current effort for agenda items.")

(defun jethro/my-org-agenda-set-effort (effort)
  "Set the effort property for the current headline."
  (interactive
   (list (read-string (format "Effort [%s]: " jethro/org-current-effort) nil nil jethro/org-current-effort)))
  (setq jethro/org-current-effort effort)
  (org-agenda-check-no-diary)
  (let* ((hdmarker (or (org-get-at-bol 'org-hd-marker)
                       (org-agenda-error)))
         (buffer (marker-buffer hdmarker))
         (pos (marker-position hdmarker))
         (inhibit-read-only t)
         newhead)
    (org-with-remote-undo buffer
      (with-current-buffer buffer
        (widen)
        (goto-char pos)
        (org-show-context 'agenda)
        (funcall-interactively 'org-set-effort nil jethro/org-current-effort)
        (end-of-line 1)
        (setq newhead (org-get-heading)))
      (org-agenda-change-all-lines newhead hdmarker))))

(defun jethro/org-agenda-process-inbox-item ()
  "处理agenda中的各项，只处理优先级就够了"
  (org-with-wide-buffer
   ;; (org-agenda-set-tags)
   (org-agenda-priority-up)
   (org-agenda-priority-up)
   ;; (call-interactively 'jethro/my-org-agenda-set-effort)
   ))

;; (defvar jethro/org-agenda-bulk-process-key ?f
;;   "Default key for bulk processing inbox items.")

(setq org-agenda-bulk-custom-functions '((?b jethro/org-agenda-process-inbox-item)))
