.config/doom/config.org
**** 使用 super-agenda 的代码
在[[file:~/doom-emacs/modules/lang/org/config.el::org-agenda-start-day][这里]] doom 对 agenda 的起始日期进行了自定义，所以下面需要 =(org-agenda-start-day "+0")=
#+begin_src emacs-lisp
(use-package! org-super-agenda
  :commands (org-super-agenda-mode))
(after! org-agenda
  (org-super-agenda-mode))
;; header 中使用 evil 快捷键问题https://github.com/alphapapa/org-super-agenda/issues/112#issuecomment-548224512
(setq org-super-agenda-header-map nil)
(setq org-agenda-skip-scheduled-if-done t
      org-agenda-skip-deadline-if-done t
      org-agenda-include-deadlines t
      org-agenda-block-separator nil
      org-agenda-tags-column 100 ;; from testing this seems to be a good value
      org-agenda-compact-blocks t)
(setq org-agenda-files '("~/org_notebooks/journal/"))
(setq org-agenda-custom-commands
      '(("o" "全局概览"
         ((agenda "" ((org-agenda-span 1)
                      (org-agenda-start-day "+0")
                      ;; 注意这里，doom 对开始日期做了自定义，所以需要改回来
                      (org-super-agenda-groups
                       '((:name "今日时间表" :time-grid t :date today :scheduled today :log (close clock) :order 1)
                         (:name "已超期" :deadline past :face error :order 2)
                         (:name "快到期了" :deadline today :deadline future :order 3)
                         ))))
          (alltodo "" ((org-agenda-overriding-header "")
                       (org-super-agenda-groups
                        '((:name "进行中" :todo "TODO" :order 1)
                          (:name "优先级A" :priority "A" :order 2)
                          (:name "优先级B" :priority "B" :order 3)
                          (:name "优先级C" :priority "C" :order 4)
                          ;; (:name "当前上课和工作" :tag "当前上课和工作" :order 5)
                          (:name "项目" :todo "PROJ" :order 6)
                          ;; (:name "Essay 1" :tag "Essay1" :order 2)
                          ;; (:name "Reading List" :tag "Read" :order 8)
                          ;; (:name "Work In Progress" :tag "WIP" :order 5)
                          ;; (:name "Blog" :tag "Blog" :order 12)
                          ;; (:name "Essay 2" :tag "Essay2" :order 3)
                          ;; (:name "Trivial" :priority<= "E" :tag ("Trivial" "Unimportant") :todo ("SOMEDAY" ) :order 90)
                          ;; (:discard (:tag ("Chore" "Routine" "Daily")))
                          ))))))))
;; 使用 =SPC o o= 打开全局概览
(map! :leader
      :prefix "o"
      :desc "agenda overview" "o" (lambda nil (interactive) (org-agenda nil "o")))
#+end_src

#+RESULTS:
| lambda | nil | (interactive) | (org-agenda nil o) |
**** 自动保存 agenda 浏览的文件
每次退出 agenda view 的时候，自动保存所有 org buffer
#+begin_src elisp
(advice-add 'org-agenda-quit :before 'org-save-all-org-buffers)
#+end_src

*** org-noter
#+begin_src emacs-lisp
(setq
      ;; org-noter-notes-window-location 'other-frame
      org-noter-always-create-frame nil
      org-noter-hide-other t
      org-noter-notes-search-path (list "~/org_notebooks/roam/public/"))
#+end_src
*** org-babel python 设置默认 session，以及结果为 output
设置 babel 的结果为 output 而非 value，也就是输出到 stdout 的东西。
默认 session 名字是 =my_py_session= 。
#+begin_src emacs-lisp
(setq org-babel-default-header-args:python '((:session . "my_py_session") (:results . "output")))
#+end_src
*** 使用 C-b 进行加粗
#+BEGIN_SRC emacs-lisp
(defun org-emphasize-bold ()
  "加粗。"
  (interactive)
  (org-emphasize ?\*))
(map! :map org-mode-map
      :v "C-b" 'org-emphasize-bold)
#+END_SRC
*** 关闭 ws-butler-mode
#+begin_src emacs-lisp
(add-hook 'org-mode-hook (lambda nil (ws-butler-mode -1)))
#+end_src
*** 使用 flameshot 进行 org-download 的截图
#+begin_src emacs-lisp
(use-package! org-download
  :config
  (setq org-download-screenshot-method "flameshot"))
#+end_src
*** ox-rst，xref-rst reStructuredText相关
#+begin_src emacs-lisp :tangle yes
(require 'ox-rst)
(require 'xref-rst)
#+end_src
** evil
*** evil-pinyin
#+BEGIN_SRC emacs-lisp
(use-package! evil-pinyin
  :after evil
  :init
  (setq-default evil-pinyin-scheme 'simplified-xiaohe-all)
  (setq-default evil-pinyin-with-search-rule 'always)
  :config
  (global-evil-pinyin-mode t))
#+END_SRC

*** evil-textobj-line
#+BEGIN_SRC emacs-lisp
(use-package! evil-textobj-line
  :after evil)
#+END_SRC

*** evil-escape
#+BEGIN_SRC emacs-lisp
(setq evil-escape-delay 0.4)
(setq evil-escape-unordered-key-sequence t)
#+END_SRC

*** evil-snipe 关掉 s 键的 snipe 功能
双字母匹配功能用不上，分配给 evil-embrace 用了。
#+BEGIN_SRC emacs-lisp
(after! evil-snipe
  (evil-snipe-mode -1))
#+END_SRC

*** evil-org-special-o/O
#+BEGIN_SRC emacs-lisp
(setq evil-org-special-o/O '(table-row item))
#+END_SRC
*** 在orgmode中，o用来换行插入，O用来换行不插入
evil-org-mode-hook 中有一个 =evil-normalize-keymaps= 会重新设置快捷键，所以需要将我自定义的快捷键放在它里面。
#+begin_src elisp
(add-hook 'evil-org-mode-hook
          (lambda nil
            (map! :map evil-org-mode-map
                  :n "O" '+evil/insert-newline-below)))
#+end_src
*** evil-embrace evil-surround
https://github.com/cute-jumper/evil-embrace.el
evil-embrace 实际上是 embrace 包和 evil-surround 结合。限定某些按键使用 evil-surround，其余都是用 embrace。
https://github.com/cute-jumper/embrace.el
不想用大写 S，直接用小写 s 执行 =evil-surround-region=
#+begin_src emacs-lisp
(map! :map evil-visual-state-map
      "s" 'evil-surround-region)
#+end_src
添加别的符号
- 空格
- latex 行内分隔符
#+begin_src emacs-lisp :tangle no
(add-hook 'text-mode-hook
          (lambda ()
            (embrace-add-pair ?  " " " ")))
(add-hook 'org-mode-hook
          (lambda ()
            (embrace-add-pair ?m "\\(" "\\)")
            (embrace-add-pair ?c "{{c1::" "}}")))
#+end_src
*** 插入模式粘贴快捷键 C-v
#+begin_src emacs-lisp
(map! :i "C-v" 'yank)
#+end_src
** 多光标 multiple-cursors, evil-mc
使用 hydra 快捷键。参考资料：
https://hungyi.net/posts/hydra-for-evil-mc/
#+BEGIN_SRC emacs-lisp
(defhydra my-mc-hydra (:color pink
                       :hint nil
                       :pre (evil-mc-pause-cursors))
  "
^Match^            ^Line-wise^           ^Manual^
^^^^^^----------------------------------------------------
_Z_: match all     _J_: make & go down   _z_: toggle here
_m_: make & next   _K_: make & go up     _r_: remove last
_M_: make & prev   ^ ^                   _R_: remove all
_n_: skip & next   ^ ^                   _p_: pause/resume
_N_: skip & prev

Current pattern: %`evil-mc-pattern

"
  ("Z" #'evil-mc-make-all-cursors)
  ("m" #'evil-mc-make-and-goto-next-match)
  ("M" #'evil-mc-make-and-goto-prev-match)
  ("n" #'evil-mc-skip-and-goto-next-match)
  ("N" #'evil-mc-skip-and-goto-prev-match)
  ("J" #'evil-mc-make-cursor-move-next-line)
  ("K" #'evil-mc-make-cursor-move-prev-line)
  ("z" #'+multiple-cursors/evil-mc-toggle-cursor-here)
  ("r" #'+multiple-cursors/evil-mc-undo-cursor)
  ("R" #'evil-mc-undo-all-cursors)
  ("p" #'+multiple-cursors/evil-mc-toggle-cursors)
  ("q" #'evil-mc-resume-cursors "quit" :color blue)
  ("<escape>" #'evil-mc-resume-cursors "quit" :color blue))
(map!
 (:when (featurep! :editor multiple-cursors)
  :prefix "g"
  :nv "z" #'my-mc-hydra/body))
#+END_SRC

** laas latex-auto-activating-snippets
#+BEGIN_SRC emacs-lisp :tangle yes
(use-package! laas
  :hook (org-mode . laas-mode)
  :config
  (setq laas-enable-auto-space nil)
  (aas-set-snippets 'laas-mode
                    :cond (lambda ()
                            (or (org-inside-LaTeX-fragment-p))
                            )
                    ";e" "\\varepsilon"
                    "tan" "\\tan"
                    ;; 范数
                    "norm" (lambda () (interactive)
                             (yas-expand-snippet "\\lVert $1 \\rVert $0"))
                    ;; 内积
                    "i*" (lambda () (interactive)
                           (yas-expand-snippet "\\langle$1\\rangle$0"))
                    "sum" (lambda () (interactive)
                            (yas-expand-snippet "\\sum_{${1:i=1}}^${2:\\infty} $0"))
                    "int" (lambda () (interactive)
                            (yas-expand-snippet (yas-lookup-snippet "int_^" 'org-mode)))
                    "sr" "^2"
                    "pw" (lambda () (interactive)
                           (yas-expand-snippet "^\{$1} $0"))
                    "lim" (lambda () (interactive)
                            (yas-expand-snippet "\\lim\\limits\_{${1:n \\to \\infty}} $0"))
                    "lrb" (lambda () (interactive)
                            (yas-expand-snippet "\\left($1\\right)$0"))
                    "lrlr" (lambda () (interactive)
                             (yas-expand-snippet "\\left${1:|}$2\\right$1$0"))
                    "sset" "\\subset "
                    "too" "\\to"
                    "noteq" "\\not= "
                    "part" (lambda () (interactive)
                             (yas-expand-snippet "\\frac{\\partial $1}{\\partial $2} $0"))
                    "deri" (lambda () (interactive)
                             (yas-expand-snippet "\\frac{d $1}{d $2} $0"))
                    ;; bind to functions!
                    :cond #'laas-object-on-left-condition
                    ",." (lambda () (interactive) (laas-wrap-previous-object "bm"))
                    ".," (lambda () (interactive) (laas-wrap-previous-object "bm"))
                    )
  )
#+END_SRC

